'''
用于分析在资源试图与现有研发管理系统人员差异，找出目前在系统中不存在的用户并生成补充sql
'''
import xlrd
import xlsxwriter
file = 'C:\\Users\\sunke\\Desktop\\研发资源视图.xls'

current_user = {'000008':'0',
'000009':'0',
'000014':'0',
'000021':'0',
'000031':'0',
'000043':'0',
'000070':'0',
'000110':'0',
'000132':'0',
'000150':'0',
'000206':'0',
'000210':'0',
'000258':'0',
'000413':'0',
'000532':'0',
'000539':'0',
'000579':'0',
'000609':'0',
'000696':'0',
'000723':'0',
'000793':'0',
'000794':'0',
'000797':'0',
'000831':'0',
'000855':'0',
'001121':'0',
'001166':'0',
'001317':'0',
'001768':'0',
'001835':'0',
'001888':'0',
'001889':'0',
'001904':'0',
'001918':'0',
'001968':'0',
'002026':'0',
'002030':'0',
'002107':'0',
'002108':'0',
'002367':'0',
'002405':'0',
'002430':'0',
'002492':'0',
'002548':'0',
'002550':'0',
'002974':'0',
'002980':'0',
'002994':'0',
'003019':'0',
'003023':'0',
'003064':'0',
'003087':'0',
'003095':'0',
'003116':'0',
'003128':'0',
'003135':'0',
'003147':'0',
'003152':'0',
'003153':'0',
'003167':'0',
'003169':'0',
'003175':'0',
'003184':'0',
'003189':'0',
'003201':'0',
'003211':'0',
'003214':'0',
'003249':'0',
'003329':'0',
'003356':'0',
'003407':'0',
'003452':'0',
'003453':'0',
'003531':'0',
'003554':'0',
'003569':'0',
'003601':'0',
'003686':'0',
'003698':'0',
'003699':'0',
'003717':'0',
'003741':'0',
'003766':'0',
'003777':'0',
'003784':'0',
'003787':'0',
'003793':'0',
'003802':'0',
'003819':'0',
'003824':'0',
'003834':'0',
'003848':'0',
'003849':'0',
'003862':'0',
'003863':'0',
'003865':'0',
'003871':'0',
'003879':'0',
'003885':'0',
'003886':'0',
'003893':'0',
'003918':'0',
'003926':'0',
'003942':'0',
'003983':'0',
'003988':'0',
'004000':'0',
'004014':'0',
'004027':'0',
'004045':'0',
'004067':'0',
'004070':'0',
'004086':'0',
'004137':'0',
'004177':'0',
'004190':'0',
'004236':'0',
'004237':'0',
'004263':'0',
'004319':'0',
'004332':'0',
'004340':'0',
'004353':'0',
'004356':'0',
'004368':'0',
'004382':'0',
'004403':'0',
'004410':'0',
'004411':'0',
'004415':'0',
'004422':'0',
'004423':'0',
'004435':'0',
'004438':'0',
'004439':'0',
'004444':'0',
'004446':'0',
'004447':'0',
'004451':'0',
'004454':'0',
'004456':'0',
'004457':'0',
'004458':'0',
'004459':'0',
'004460':'0',
'004461':'0',
'004464':'0',
'004467':'0',
'004469':'0',
'004471':'0',
'004480':'0',
'004489':'0',
'004492':'0',
'004494':'0',
'004496':'0',
'004500':'0',
'004501':'0',
'004502':'0',
'004504':'0',
'004524':'0',
'004531':'0',
'004532':'0',
'004539':'0',
'004546':'0',
'004555':'0',
'004556':'0',
'004558':'0',
'004563':'0',
'004565':'0',
'004570':'0',
'004574':'0',
'004575':'0',
'004583':'0',
'004603':'0',
'004605':'0',
'004616':'0',
'004617':'0',
'004647':'0',
'004651':'0',
'004658':'0',
'004661':'0',
'004696':'0',
'004745':'0',
'004753':'0',
'004757':'0',
'004760':'0',
'004761':'0',
'004762':'0',
'004769':'0',
'004780':'0',
'004789':'0',
'004794':'0',
'004820':'0',
'004848':'0',
'004857':'0',
'004869':'0',
'004871':'0',
'004880':'0',
'004888':'0',
'004889':'0',
'004890':'0',
'004909':'0',
'004923':'0',
'004925':'0',
'004870':'0',
'X-XT000050':'0',
'X-XT000115':'0',
'X-XT000119':'0',
'X-XT000145':'0',
'X-XT000168':'0',
'X-XT000258':'0',
'X-XT000281':'0',
'X-XT000289':'0',
'X-XT000291':'0',
'X-XT000294':'0',
'X-XT000311':'0',
'X-XT000334':'0',
'X-XT000348':'0',
'X-XT000355':'0',
'X-XT000361':'0',
'X-XT000366':'0',
'X-XT000367':'0',
'X-XT000377':'0',
'X-XT000408':'0',
'X-XT000412':'0',
'X-XT000454':'0',
'X-XT000457':'0',
'X-XT000458':'0',
'X-XT000467':'0',
'X-XT000470':'0',
'X-XT000488':'0',
'X-XT000490':'0',
'X-XT000495':'0',
'X-XT000501':'0',
'X-XT000504':'0',
'X-XT000505':'0',
'X-XT000507':'0',
'X-XT000509':'0',
'X-XT000512':'0',
'X-XT000515':'0',
'X-XT000517':'0',
'X-XT000518':'0',
'X-XT000519':'0',
'X-XT000520':'0',
'X-XT000523':'0',
'X-XT000525':'0',
'X-XT000526':'0',
'X-XT000526':'0',
'X-XT000528':'0',
'X-XT000532':'0',
'X-XT000533':'0',
'X-XT000542':'0',
'X-XT000543':'0',
'X-XT000544':'0',
'X-XT000552':'0',
'X-XT000556':'0',
'X-XT000560':'0',
'X-XT000564':'0',
'X-XT000566':'0',
'X-XT000572':'0',
'X-XT000578':'0',
'X-XT000581':'0',
'X-ZN000097':'0',
'X-ZN000112':'0',
'X-ZN000115':'0',
'X-ZN000121':'0',
'X-ZN000228':'0',
'X-ZN000248':'0',
'X-ZN000253':'0',
'X-ZN000260':'0',
'X-ZN000276':'0',
'X-ZN000299':'0',
'X-ZN000310':'0',
'X-ZN000350':'0',
'X-ZN000374':'0',
'X-ZN000440':'0',
'X-ZN000450':'0',
'X-ZN000462':'0',
'X-ZN000465':'0',
'X-ZN000474':'0',
'X-ZN000475':'0',
'X-ZN000501':'0',
'X-ZN000511':'0'}


def handleConfigData(table):
    # for row in range(table.nrows):
    #     rdata = table.row_values(row, 6)
    #     print(rdata)
    #     rstConfigData.append(rdata)
    # return rstConfigData
    for col in range(table.ncols):
        if col <= 5:
            continue
        cdata = table.col_values(col)
        ## 删除空白
        while '' in cdata:
            cdata.remove('')
        print(cdata)

"""
处理excel 原始数据 sheet。获取用户信息[用户名，状态，工单号，所属大项目，所属子项目,投入比]列表
"""
def handleUserData(table):
    r0Data = table.row_values(0)
    print(r0Data)
    # ['姓名', '人员状态', '人员类型', '三级部门', '四级部门', '所属大项目', '所属子项目', '投入百分比',
    f = open('t_smt_user.sql', 'w+', encoding='utf-8')
    fratio = open('t_user_project_ratio.sql', 'w+', encoding='utf-8')
    for row in range(table.nrows):
        rdata = table.row_values(row)
        if row == 0:
            name_idx = rdata.index('姓名')
            status_idx = rdata.index('人员状态')
            type_idx = rdata.index('人员类型')
            dep3_idx = rdata.index('三级部门')
            dep4_idx = rdata.index('四级部门')
            bus_idx = rdata.index('所属大项目')
            server_idx = rdata.index('所属子项目')
            ratio_idx = rdata.index('投入百分比')
            userno_idx = rdata.index('工号')
            continue
        else:
            status = '0'
            if rdata[status_idx] != '在岗' or rdata[name_idx] == '赖勇武':
                continue
            if current_user.get(rdata[userno_idx]):
                continue

            print("'%s'," % rdata[userno_idx])
            t = '1'
            if rdata[type_idx] == '自有人员':
                t = '0'

            serverName = rdata[server_idx]
            if '&' in rdata[server_idx]:
                serverName = rdata[server_idx].replace('&', "'||chr(38)||'")
            sql = """insert into t_smt_user (CODE_, USER_NO, REAL_NAME, LOGIN_NAME, DEPARTMENT, DEPARTMENT3, DEPARTMENT4, BUSINESS_UNIT, RATIO_, TYPE_, IS_DELETE)
                  values (null, '%s', '%s', '%s', '卓望公司/卓望数码/研发二部/%s/%s', '%s', '%s', '卓望数码-%s-%s', %d, '%s', '%s');\n
              """ % (rdata[userno_idx], rdata[name_idx], rdata[name_idx], rdata[dep3_idx], rdata[dep4_idx],
                     rdata[dep3_idx], rdata[dep4_idx], rdata[bus_idx], serverName,
                     float(rdata[ratio_idx]), t, status)

            userProjectRatioSql = """insert into t_user_project_relation (USER_NO, CODE_, RATIO_)
                                    values ('%s', '%s', %d);""" % (rdata[userno_idx], serverName, float(rdata[ratio_idx]))
            fratio.write(userProjectRatioSql)
            fratio.flush()
            f.write(sql)
            f.flush()
        # f.close()

if __name__ == '__main__':
    xl = xlrd.open_workbook(file)
    sheetNameList = xl.sheet_names()
     ## 需要读取配置表 和原始
    print(sheetNameList)
    # 配置表 原始数据
    # configSheetIdx = sheetNameList.index('配置表')
    orgDataSheetIdx = sheetNameList.index('原始数据')
    # print('configSheetIdx=%d' % configSheetIdx)
    print('orgDataSheetIdx=%d' % orgDataSheetIdx)
    # rstConfigData = []
    rstOrgData = []
    # handleConfigData(xl.sheets()[configSheetIdx])
    handleUserData(xl.sheets()[orgDataSheetIdx])
    # for i in len(rstConfigData)

    ## 人员信息， 投入信息